[
    {
        "id": "1",
        "text": "What is the smallest unit of information a computer can store, and what are its two possible values?",
        "options": [
            "Byte - 0 to 255",
            "Bit - 1 or 0",
            "Nibble - 0 to 15",
            "Word - 32 or 64 values"
        ],
        "correctAnswer": 1,
        "explanation": "A bit is the fundamental unit of information in computing, representing a binary value of either 1 or 0."
    },
    {
        "id": "2",
        "text": "What is the primary purpose of a code in the context of information representation?",
        "options": [
            "To encrypt data for security",
            "To compress data for storage",
            "To associate bit combinations with information like characters",
            "To error-correct data during transmission"
        ],
        "correctAnswer": 2,
        "explanation": "A code creates a standardized mapping between combinations of bits and specific information elements like characters, numbers, or symbols."
    },
    {
        "id": "3",
        "text": "Why are standards like those from ISO and IEEE important for information representation?",
        "options": [
            "To maximize proprietary technology advantages",
            "To ensure interoperability through common meaning for codes",
            "To increase manufacturing costs for competitive advantage",
            "To limit the number of available character sets"
        ],
        "correctAnswer": 1,
        "explanation": "Standards ensure that the same code means the same thing across different systems and implementations, enabling universal interoperability."
    },
    {
        "id": "4",
        "text": "What does the acronym ASCII stand for and how many bits does it use?",
        "options": [
            "Advanced Standard Code for Information Interchange - 8 bits",
            "American Standard Code for Information Interchange - 7 bits",
            "Automated System for Computer Information Interchange - 16 bits",
            "Adaptive Symbolic Code for Information Interchange - variable bits"
        ],
        "correctAnswer": 1,
        "explanation": "ASCII stands for American Standard Code for Information Interchange and uses 7 bits to represent characters."
    },
    {
        "id": "5",
        "text": "According to the provided ASCII table, what is the hexadecimal code for the 'carriage return' control character?",
        "options": [
            "0A",
            "0D",
            "1B",
            "20"
        ],
        "correctAnswer": 1,
        "explanation": "The carriage return (CR) control character has hexadecimal code 0D (Dec 13, Hx D, Oct 015)."
    },
    {
        "id": "6",
        "text": "How does Unicode fundamentally differ from ASCII in its design goal?",
        "options": [
            "Unicode uses fewer bits than ASCII for efficiency",
            "Unicode is proprietary while ASCII is an open standard",
            "Unicode supports only Western languages while ASCII is global",
            "Unicode provides a unique code for symbols across many writing systems"
        ],
        "correctAnswer": 3,
        "explanation": "Unicode is a 32-bit standard designed to provide unique codes for symbols across many writing systems worldwide, while ASCII is limited to English characters and basic symbols."
    },
    {
        "id": "7",
        "text": "Name three types of media used to transmit signals.",
        "options": [
            "Water, metal, wood",
            "Copper cables, optical fibre, free space (air)",
            "Plastic, glass, rubber",
            "Silicon, carbon, aluminum"
        ],
        "correctAnswer": 1,
        "explanation": "Signals are transmitted through various media including copper cables, optical fibre, and free space (air) for wireless communication."
    },
    {
        "id": "8",
        "text": "What form of energy is typically manipulated to generate signals for transmission?",
        "options": [
            "Thermal energy",
            "Potential energy",
            "Electrical, electromagnetic, or light energy",
            "Kinetic energy"
        ],
        "correctAnswer": 2,
        "explanation": "Signals are generated by manipulating electrical energy (in wires), electromagnetic energy (in wireless), or light energy (in fiber optics)."
    },
    {
        "id": "9",
        "text": "Define an analog signal and contrast it with a digital signal.",
        "options": [
            "Analog is discrete-valued, digital is continuous",
            "Analog is binary, digital is multi-valued",
            "Analog is continuously varying, digital has discrete values",
            "Analog is for audio, digital is for video"
        ],
        "correctAnswer": 2,
        "explanation": "An analog signal is continuously varying and can take any value between two points, while a digital signal has discrete, specific values it can assume."
    },
    {
        "id": "10",
        "text": "What is the key characteristic that distinguishes a periodic signal from an aperiodic signal?",
        "options": [
            "Periodic signals have constant amplitude",
            "Periodic signals repeat their pattern over time",
            "Aperiodic signals have higher frequency",
            "Aperiodic signals are always digital"
        ],
        "correctAnswer": 1,
        "explanation": "A periodic signal repeats its wave pattern at regular intervals, while an aperiodic signal has no repeating pattern."
    }
]